# Через список
month_num = int(input('Введите номер месяца, от 1 до 12: '))
seasons_list = ['зима.', 'зима.', 'зима.', 'весна.', 'весна.', 'весна.', 'лето.', 'лето.', 'лето.', 'осень.', 'осень.', 'осень.']
if month_num == 12:
    month_num = 0
print('Это ', seasons_list[month_num])

# Через словарь
month_num = int(input('Введите номер месяца, от 1 до 12: '))
seasons_dict = {1: 'зима.', 2: 'зима.', 12: 'зима.', 3: 'весна.', 4: 'весна.', 5:  'весна.', 6: 'лето.', 7: 'лето.', 8: 'лето.', 9: 'осень.', 10: 'осень.', 11: 'осень.'}
print('Это ', seasons_dict.get(month_num))

